cxf/camel-cxf-contract-first/src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ord="http://order.camelinaction">
   <soapenv:Body>
      <ord:partName>motor</ord:partName>
      <ord:amount>1</ord:amount>
      <ord:customerName>honda</ord:customerName>
   </soapenv:Body>
</soapenv:Envelope>
